journal-app/app/controllers/application_controller.rb

  def set_entry
    @entry = Entry.find(params[:id]) if params[:id].present?
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]