journal-app/app/controllers/entries_controller.rb

  def show
    @entry = Entry.find(params[:id]) # Set @entry only for the show action
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]