journal-app/app/controllers/entries_controller.rb

  def index
    @entries = Entry.all
    @entries.each do |entry|
      entry.start_time = entry.created_at if entry.respond_to?(:start_time=)
---
SELECT "entries".* FROM "entries"
INSERT INTO "entries" ("name", "created_at", "updated_at", "link") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test-2"], ["created_at", "2025-03-31 15:38:37.640372"], ["updated_at", "2025-03-31 15:38:37.640372"], ["link", nil]]

  def create
    @entry = Entry.new(entry_params)
    if @entry.save
---
INSERT INTO "entries" ("name", "created_at", "updated_at", "link") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["created_at", "2025-04-07 20:44:36.978727"], ["updated_at", "2025-04-07 20:44:36.978727"], ["link", "test"]]

  def destroy
    Entry.find(params[:id]).destroy
---
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 4]]
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @entry = Entry.find(params[:id])
    if @entry.update(entry_params)
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
UPDATE "entries" SET "name" = $1, "updated_at" = $2 WHERE "entries"."id" = $3  [["name", "New Title"], ["updated_at", "2025-04-08 10:05:59.524410"], ["id", 68]]

  def set_entry
    @entry = Entry.find(params[:id]) if params[:id].present?
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]