journal-app/app/controllers/entries_controller.rb

SELECT DISTINCT "entries".* FROM "entries" LEFT OUTER JOIN "shared_entries" ON "shared_entries"."entry_id" = "entries"."id" WHERE ("entries"."user_id" = $1 OR "shared_entries"."user_id" = $2)  [["user_id", 47], ["user_id", 47]]
---
  def index
    # Fetch entries created by the user or shared with the user
    @entries = Entry.left_joins(:shared_entries)
                    .where(user: current_user)
                    .or(Entry.where(shared_entries: { user_id: current_user.id }))
                    .distinct

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "shared_entries" ON "users"."id" = "shared_entries"."user_id" WHERE "shared_entries"."entry_id" = $1 AND "users"."id" = $2 LIMIT $3  [["entry_id", 307], ["id", 47], ["LIMIT", 1]]
---
  def show
    # Ensure the user has access to the entry
    unless @entry.user == current_user || @entry.shared_with_users.include?(current_user)

SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 307], ["LIMIT", 1]]
---
  def set_entry
    @entry = Entry.find(params[:id])