journal-app/app/views/shared/_sidebar.html.erb

SELECT "entries".* FROM "entries" ORDER BY "entries"."created_at" DESC LIMIT $1  [["LIMIT", 5]]
---
        <h3>Recent Entries</h3>
        <%= render partial: "shared/sidebar_component", collection: Entry.order(created_at: :desc).limit(5) %>